In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
plt.rcParams['font.family'] = 'Malgun Gothic'
plt.rcParams['axes.unicode_minus'] = False

In [3]:
df = pd.read_csv('data/grade.csv')
df

    학년  과목   결과  중간  기말
0  1학년  국어   좋음  80  90
1  1학년  국어   나쁨  50  40
2  1학년  국어   나쁨  20  50
3  1학년  수학   좋음  83  95
4  1학년  수학   좋음  93  86
5  2학년  국어   나쁨  44  65
6  2학년  국어   좋음  95  98
7  2학년  수학   좋음  96  99
8  2학년  수학   나쁨  57  69

In [4]:
df[['중간','기말']].sum()

중간    618
기말    692
dtype: int64

DataFrameGroupBy : sum, mean, max, std, min, agg(다양한 결과값을 한 번에 볼 때 사용), count

In [5]:
df.groupby('학년')[['중간','기말']].sum() #데이터프레임 GroupBy 객체

      중간   기말
학년
1학년  326  361
2학년  292  331

In [6]:
df.groupby('학년')[['중간','기말']].mean() #학년별 중간 기말 평균

       중간     기말
학년
1학년  65.2  72.20
2학년  73.0  82.75

In [7]:
df.groupby('학년')[['중간','기말']].max()

     중간  기말
학년
1학년  93  95
2학년  96  99

In [8]:
df.groupby('학년')[['중간','기말']].count()

     중간  기말
학년
1학년   5   5
2학년   4   4

In [9]:
df.groupby(['학년','과목'])[['중간','기말']] # 학년 및 과목별

In [10]:
df.groupby(['학년','과목'])[['중간','기말']].sum()

         중간   기말
학년  과목
1학년 국어  150  180
    수학  176  181
2학년 국어  139  163
    수학  153  168

In [11]:
df.groupby(['학년','과목'])[['중간','기말']].mean()

          중간    기말
학년  과목
1학년 국어  50.0  60.0
    수학  88.0  90.5
2학년 국어  69.5  81.5
    수학  76.5  84.0

In [12]:
df.groupby('학년')[['중간','기말']].agg( ['sum','mean'] )

      중간         기말
     sum  mean  sum   mean
학년
1학년  326  65.2  361  72.20
2학년  292  73.0  331  82.75

In [13]:
df.groupby('학년')[['중간','기말']].agg( ['sum','mean'] )

      중간         기말
     sum  mean  sum   mean
학년
1학년  326  65.2  361  72.20
2학년  292  73.0  331  82.75

In [14]:
df.groupby('학년')['중간'].agg( ['sum','mean'] )

     sum  mean
학년
1학년  326  65.2
2학년  292  73.0

In [15]:
def fn(v):
    print(v)
    print('='*20)
    return v.mean()

In [16]:
df.groupby('학년')['중간'].agg(fn) # 1학년 2학년 따로 출력

0    80
1    50
2    20
3    83
4    93
Name: 중간, dtype: int64
====================
5    44
6    95
7    96
8    57
Name: 중간, dtype: int64
====================

학년
1학년    65.2
2학년    73.0
Name: 중간, dtype: float64

In [17]:
df.groupby('학년')['중간'].agg( lambda v:v.mean() )

학년
1학년    65.2
2학년    73.0
Name: 중간, dtype: float64

In [18]:
# Q) 학년 별로 중간, 기말고사 평균이 70점 이상이면 합격 아니면 불합격
df.groupby('학년')[['중간','기말']].agg( lambda v: '합격' if v.mean()>=70 else '불합격' )

      중간  기말
학년
1학년  불합격  합격
2학년   합격  합격

In [19]:
df.pivot_table(values='중간', index='학년') #학년별 중간고사 집계

       중간
학년
1학년  65.2
2학년  73.0

In [20]:
df.pivot_table(values='중간', index='학년', aggfunc="sum")

      중간
학년
1학년  326
2학년  292

In [21]:
df.pivot_table(values=['중간','기말'] , 
               index='학년', aggfunc=["mean","sum"], sort=False) #학년별 중간 기말에 대한 평균, 총합의 값

     mean         sum
       중간     기말   중간   기말
학년
1학년  65.2  72.20  326  361
2학년  73.0  82.75  292  331

In [22]:
df.pivot_table(values='중간', index='학년',
                aggfunc=lambda v: '합격' if v.mean() >= 70 else '불합격')

      중간
학년
1학년  불합격
2학년   합격

In [23]:
df1 = df.pivot_table(values='중간', index='학년',
                aggfunc=[ 'mean',lambda v: '합격' if v.mean() >= 70 else '불합격'])
df1.rename(columns={'mean':'평균', '<lambda>':'결과'} )

       평균   결과
       중간   중간
학년
1학년  65.2  불합격
2학년  73.0   합격

In [24]:
df2 = df.groupby('학년')['중간'].agg( ['mean', lambda v: '합격' if v.mean()>=70 else '불합격'] )
df2.rename(index={'1학년':'1학년임'}, 
            columns={'mean':'중간고사 평균','<lambda_0>':'중간고사 결과'})

      중간고사 평균 중간고사 결과
학년
1학년임     65.2     불합격
2학년      73.0      합격

In [25]:
df

    학년  과목   결과  중간  기말
0  1학년  국어   좋음  80  90
1  1학년  국어   나쁨  50  40
2  1학년  국어   나쁨  20  50
3  1학년  수학   좋음  83  95
4  1학년  수학   좋음  93  86
5  2학년  국어   나쁨  44  65
6  2학년  국어   좋음  95  98
7  2학년  수학   좋음  96  99
8  2학년  수학   나쁨  57  69

In [26]:
%pip install openpyxl

Requirement already satisfied: openpyxl in c:\python310\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\python310\lib\site-packages (from openpyxl) (2.0.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip available: 22.3.1 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [27]:
hotelDF = pd.read_excel('data/hotel.xlsx', index_col='Unnamed: 0')
hotelDF

      grade  rate  price
호텔1      10     1   9500
호텔2       8     2   8000
호텔3       6     4   6000
호텔4       9     2   8600
호텔5       7     4   7000
호텔6       8     2   8300
호텔7       5     5   5000
호텔8       5     5   5200
호텔9       8     3   8100
호텔10     10     1   9300
호텔11      9     3   8800
호텔12      7     4   7100
호텔13      8     3   8500
호텔14      5     4   5200
호텔15      5     5   3200
호텔16      6     4   6800
호텔17      7     4   7100
호텔18      8     3   8400
호텔19      5     4   2200
호텔20      5     5   4500

In [31]:
# Q) 등급별 가격 평균과 가격정도 (8500 이상이면 '높음' 아니면 '낮음')
hdf = hotelDF.groupby('grade')[['price']].agg(['mean', lambda v: '높음' if v.mean()>=8500 else '낮음'])
hdf.rename(columns={'<lambda_0>':'가격정도','mean':'가격평균'})

             price
              가격평균 가격정도
grade
5      4216.666667   낮음
6      6400.000000   낮음
7      7066.666667   낮음
8      8260.000000   낮음
9      8700.000000   높음
10     9400.000000   높음

In [29]:
hotelDF

      grade  rate  price
호텔1      10     1   9500
호텔2       8     2   8000
호텔3       6     4   6000
호텔4       9     2   8600
호텔5       7     4   7000
호텔6       8     2   8300
호텔7       5     5   5000
호텔8       5     5   5200
호텔9       8     3   8100
호텔10     10     1   9300
호텔11      9     3   8800
호텔12      7     4   7100
호텔13      8     3   8500
호텔14      5     4   5200
호텔15      5     5   3200
호텔16      6     4   6800
호텔17      7     4   7100
호텔18      8     3   8400
호텔19      5     4   2200
호텔20      5     5   4500